# ReleaseConditions Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReleaseConditions Class
Members See Also
---
An object that represents a Release Conditions on analytical element.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public class ReleaseConditions : IDisposable
```

Visual Basic
---
```text
Public Class ReleaseConditions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ReleaseConditions : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure..::..ReleaseConditions
# See Also
ReleaseConditions Members
Autodesk.Revit.DB.Structure Namespace